# IFCParameter Template Is In Session Template Method

Source: https://www.revitapidocs.com/2026/b0b5239b-2739-9970-e081-abd4571514cf.htm

---

| IFCParameter Template Is In Session Template Method |
| --- |

Returns true if this is an in\-session template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsInSessionTemplate()
```

```
Public Function IsInSessionTemplate As Boolean
```

```
public:
bool IsInSessionTemplate()
```

```
member IsInSessionTemplate : unit -> bool
```

#### Return Value

Boolean
Whether or not the template is in\-session. See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace